const config = require('../config')
const { cmd, commands } = require('../command');
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')

cmd({
    pattern: "menu",
    alias: ["allmenu","fullmenu"],
    use: '.menu',
    desc: "Show all bot commands",
    category: "menu",
    react: "📜",
    filename: __filename
}, 
async (conn, mek, m, { from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply }) => {
    try {
        let dec = `‎*╭─══════════════⊷❍*
‎*┋❁┋. ʙᴏᴛ ɴᴀᴍᴇ: ${config.BOT_NAME}*
‎*┋❁┋. ᴠᴇʀꜱɪᴏɴ: 4.0.0*
‎*┋❁┋. ʀᴜɴᴛɪᴍᴇ: ${runtime(process.uptime())}*
‎*┋❁┋. ᴅᴇᴠ : ʀᴀʜᴍᴀɴ ᴛᴇᴄʜ*     
‎*┋❁┋. ᴘʟᴀᴛғᴏʀᴍ: ${os.platform()}*
‎*┋❁┋. ᴍᴏᴅᴇ: ${config.MODE}*
‎*┋❁┋. ᴘʀᴇғɪx: [${config.PREFIX}]*
‎*┋❁╰───────────────*
‎*╰═════════════════⍟*
‎
‎*╭─❍ 𝙳𝙾𝚆𝙽𝙻𝙾𝙰𝙳 ══════⊷❍*
‎*┋❀┃. ᴛɪᴋᴛᴏᴋ*
‎*┋❀┃. ғᴀᴄᴇʙᴏᴏᴋ*
‎*┋❀┃. ᴀᴘᴋ*
‎*┋❀┃. ɪɴsᴛᴀ*
‎*┋❀┃. ᴛᴡɪᴛᴛᴇʀ*
‎*┋❀┃. ᴘʟᴀʏ*
‎*┋❀┃. ᴘʟᴀʏ2*
‎*┋❀┃. ᴘɪɴᴛᴇʀᴇsᴛ*
‎*┋❀┃. sᴘᴏᴛɪғʏ*
‎*┋❀┃. ᴀᴜᴅɪᴏ*
‎*┋❀┃. ᴠɪᴅᴇᴏ*
‎*┋❀┃. ᴠɪᴅᴇᴏ2*
‎*┋❀┃. ʏᴛᴍᴘ4*
‎*┋❀┃. ᴍᴇᴅɪᴀғɪʀᴇ*
‎*┋❀┃. ɢᴅʀɪᴠᴇ*
‎*┋❀┃. ᴛɪᴋs*
‎*┋❀┃. ssᴡᴇʙ*
‎*┋❀┃. ᴅᴀʀᴀᴍᴀ*
‎*┋❀╰────────────────*
‎*╰══════════════════⍟*
‎
‎*╭─❍ 𝙻𝙾𝙶𝙾 𝙼𝙰𝙺𝙴𝚁 ══════⊷❍*
‎*┋❀┃. ᴅʀᴀɢᴏɴʙᴀʟʟ*
‎*┋❀┃. ʙʟᴀᴄᴋᴘɪɴᴋ*
‎*┋❀┃. ɴᴇᴏɴʟɪɢʜᴛ*
‎*┋❀┃. sᴀᴅɢɪʀʟ*
‎*┋❀┃. ɴᴀʀᴜᴛᴏ*
‎*┋❀┃. 3ᴅᴄᴏᴍɪᴄ*
‎*┋❀┃. 3ᴅᴘᴀᴘᴇʀ*
‎*┋❀┃. ғᴜᴛᴜʀɪsᴛɪᴄ*
‎*┋❀┃. ᴄʟᴏᴜᴅs*
‎*┋❀┃. ʟᴇᴀғ*
‎*┋❀┃. ᴇʀᴀsᴇʀ*
‎*┋❀┃. sᴜɴsᴇᴛ*
‎*┋❀┃. ɢᴀʟᴀxʏ*
‎*┋❀┃. sᴀɴs*
‎*┋❀┃. ʙᴏᴏᴍ*
‎*┋❀┃. ʜᴀᴄᴋᴇʀ*
‎*┋❀┃. ᴅᴇᴠɪʟᴡɪɴɢs*
‎*┋❀┃. ɴɪɢᴇʀɪᴀ*
‎*┋❀┃. ʙᴜʟʙ*
‎*┋❀┃. ᴀɴɢᴇʟᴡɪɴɢs*
‎*┋❀┃. ᴢᴏᴅɪᴀᴄ*
‎*┋❀┃. ʟᴜxᴜʀʏ*
‎*┋❀┃. ᴘᴀɪɴᴛ*
‎*┋❀┃. ғʀᴏᴢᴇɴ*
‎*┋❀┃. ᴄᴀsᴛʟᴇ*
‎*┋❀┃. ᴛᴀᴛᴏᴏ*
‎*┋❀┃. ᴠᴀʟᴏʀᴀɴᴛ*
‎*┋❀┃. ʙᴇᴀʀ*
‎*┋❀┃. ᴛʏᴘᴏɢʀᴀᴘʜʏ*
‎*┋❀┃. ʙɪʀᴛʜᴅᴀʏ*
‎*┋❀╰────────────────*
‎*╰══════════════════⍟*

‎*╭─❍ 𝙼𝙰𝙸𝙽 ══════════⊷❍*
‎*┋❀┃. ᴍᴇɴᴜ*
‎*┋❀┃. ᴏᴡɴᴇʀ*
‎*┋❀┃. ʟɪsᴛᴄᴍᴅ*
‎*┋❀┃. ʀᴇᴘᴏ*
‎*┋❀┃. ʙʟᴏᴄᴋ*
‎*┋❀┃. ᴜɴʙʟᴏᴄᴋ*
‎*┋❀┃. ʀᴇsᴛᴀʀᴛ*
‎*┋❀┃. ғᴜʟʟᴘᴘ*
‎*┋❀┃. sᴇᴛᴘᴘ*
‎*┋❀┃. ᴀʟɪᴠᴇ*
‎*┋❀┃. ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*
‎*┋❀┃. sʜᴜᴛᴅᴏᴡɴ*
‎*┋❀┃. ᴊɪᴅ*
‎*┋❀┃. ᴘɪɴɢ* 
‎*┋❀┃. ɢᴊɪᴅ*
‎*┋❀┃. sᴇᴛᴘᴘ*
‎*┋❀╰───────────────*
‎*╰═════════════════⍟*
‎
‎*╭─❍ 𝙾𝚃𝙷𝙴𝚁 ═════════⊷❍*
‎*┋❀┃. ᴀʟɪᴠᴇ*
‎*┋❀┃. ʟɪᴠᴇ*
‎*┋❀┃. sᴘᴇᴇᴅ*
‎*┋❀┃. ʀᴇᴘᴏ*
‎*┋❀┃. ᴜᴘᴛɪᴍᴇ*
‎*┋❀┃. ʀᴜɴᴛɪᴍᴇ*
‎*┋❀┃. ᴛɪᴍᴇɴᴏᴡ*
‎*┋❀┃. ᴄᴀʟᴄᴜʟᴀᴛᴇ*
‎*┋❀┃. ᴄᴏᴜɴᴛ*
‎*┋❀┃. ᴅᴀᴛᴇ*
‎*┋❀┃. ᴄᴘᴘ*
‎*┋❀┃. ғᴀᴄᴛ*
‎*┋❀┃. ᴡᴇᴀᴛʜᴇʀ*
‎*┋❀┃. ғᴀɴᴄʏ*
‎*┋❀┃. ᴅᴇғɪɴᴇ*
‎*┋❀┃. ɴᴇᴡs*
‎*┋❀┃. sʀᴇᴘᴏ*
‎*┋❀┃. ɢɪᴛʜᴜʙsᴛᴀʟᴋ*
‎*┋❀┃. ᴡɪᴋɪᴘᴇᴅɪᴀ*
‎*┋❀┃. sᴀᴠᴇ*
‎*┋❀┃. ᴄᴏɪɴғʟɪᴘ*
‎*┋❀┃. ʀᴄᴏʟᴏʀ*
‎*┋❀┃. ʀᴏʟʟ*
‎*┋❀┃. ʟᴏɢᴏ*
‎*┋❀┃. ʀᴡ*
‎*┋❀┃. ᴘᴀɪʀ*
‎*┋❀┃. ᴍᴏᴠɪᴇ*
‎*┋❀╰────────────────*
‎*╰══════════════════⍟*
‎
‎*╭─❍ 𝙲𝙾𝙽𝚅𝙴𝚁𝚃𝙴𝚁 ══════⊷❍*
‎*┋❀┃. sᴛɪᴄᴋᴇʀ*
‎*┋❀┃. ᴛᴀᴋᴇ*
‎*┋❀┃. ᴇᴍᴏᴊɪᴍɪx*
‎*┋❀┃. ᴛᴛs*
‎*┋❀┃. ᴛᴏᴍᴘ3*
‎*┋❀┃. ᴛʀᴛ*
‎*┋❀┃. ʙᴀsᴇ64*
‎*┋❀┃. ᴜɴʙᴀsᴇ64*
‎*┋❀┃. ᴅʙɪɴᴀʀʏ*
‎*┋❀┃. ᴛɪɴʏᴜʀʟ*
‎*┋❀┃. ᴜʀʟ*
‎*┋❀┃. ᴜʀʟᴇɴᴄᴏᴅᴇ*
‎*┋❀┃. ᴜʀʟᴅᴇᴄᴏᴅᴇ*
‎*┋❀┃. ʀᴇᴀᴅᴍᴏʀᴇ*
‎*┋❀┃. ʀᴇᴘᴇᴀᴛ*
‎*┋❀┃. ᴀsᴋ*
‎*┋❀╰────────────────*
‎*╰══════════════════⍟*
‎
‎*╭─❍ 𝙰𝙽𝙸𝙼𝙴 ═════════⊷❍*
‎*┋❀┃. ғᴏxɢɪʀʟ*
‎*┋❀┃. ᴀɴɪᴍᴇɴᴇᴡs*
‎*┋❀┃. ɴᴀʀᴜᴛᴏ*
‎*┋❀┃. ᴅᴀʀᴇ*
‎*┋❀┃. ғᴀᴄᴋ*
‎*┋❀┃. ᴛʀᴜᴛʜ*
‎*┋❀┃. ɢᴀʀʟ*
‎*┋❀┃. ᴀᴡᴏᴏ*
‎*┋❀┃. ᴅᴏɢ*
‎*┋❀┃. ɴᴇᴋᴏ*
‎*┋❀┃. ᴡᴀɪғᴜ*
‎*┋❀┃. ʟᴏʟɪ*
‎*┋❀┃. ᴍᴀɪᴅ*
‎*┋❀┃. ᴍᴇɢɴᴜᴍɪɴ*
‎*┋❀┃. ᴀɴɪᴍᴇɢɪʀʟ*
‎*┋❀┃. ᴀɴɪᴍᴇɢɪʀʟ1*
‎*┋❀┃. ᴀɴɪᴍᴇɢɪʀʟ2*
‎*┋❀┃. ᴀɴɪᴍᴇ1*
‎*┋❀┃. ᴀɴɪᴍᴇ2*
‎*┋❀┃. ᴀɴɪᴍᴇ3*
‎*┋❀╰───────────────*
‎*╰═════════════════⍟*
‎
‎*╭─❍ 𝙰𝙸 ═══════════⊷❍*
‎*┋❀┃. ᴀɪ*
‎*┋❀┃. ɢᴘᴛ*
‎*┋❀┃. ɢᴘᴛ2*
‎*┋❀┃. ɢᴘᴛ3*
‎*┋❀┃. ᴍᴇᴛᴀ*
‎*┋❀┃. ɢᴘᴛᴍɪɴɪ*
‎*┋❀┃. ʙʟᴀᴄᴋʙᴏx*
‎*┋❀┃. ᴅᴊ*
‎*┋❀┃. ʟᴜᴍᴀ*
‎*┋❀┃. ɪᴍᴀɢɪɴᴇ*
‎*┋❀┃. ɪᴍᴀɢɪɴᴇ2*
‎*┋❀┃. ɢᴘᴛ4*
‎*┋❀┃. ᴄᴏᴘɪʟᴏᴛ*
‎*┋❀┃. ʙɪɴɢ*
‎*┋❀┃. ʀᴀʜᴍᴀɴ*
‎*┋❀╰───────────────*
‎*╰═════════════════⍟*}`;

        await conn.sendMessage(
            from,
            {
                image: { url: config.MENU_IMAGE_URL || 'https://files.catbox.moe/84jssf.jpg' },
                caption: dec,
                contextInfo: {
                    mentionedJid: [m.sender],
                    forwardingScore: 999,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363201214007503@newsletter',
                        newsletterName: config.BOT_NAME,
                        serverMessageId: 143
                    }
                }
            },
            { quoted: mek }
        );

        // Send audio
        await conn.sendMessage(from, {
            audio: { url: 'https://files.catbox.moe/k0em5t.mp3' },
            mimetype: 'audio/mp4',
            ptt: true
        }, { quoted: mek });
        
    } catch (e) {
        console.log(e);
        reply(`❌ Error: ${e}`);
    }
});
